"""
1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
"""

a = int(input("Введите трехзначное целое число: "))
sum = 0
mult = 1
sum = sum + (a % 10)
mult = mult * (a % 10)
a = a // 10
sum = sum + (a % 10)
mult = mult * (a % 10)
a = a // 10
sum = sum + a
mult = mult * a
print(f"Сумма цифр равна {sum}")
print(f"Произведение цифр равна {mult}")
